tinyNozzle/2D/6_with3outlets_cyclic_volume_3.27Exit_sharp_10deg/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    front
    {
        type            wedge;
        nFaces          105480;
        startFace       209792;
    }
    back
    {
        type            wedge;
        nFaces          105480;
        startFace       315272;
    }
    inlet
    {
        type            patch;
        nFaces          17;
        startFace       420752;
    }
    outlet
    {
        type            patch;
        nFaces          914;
        startFace       420769;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          553;
        startFace       421683;
    }
)

// ************************************************************************* //
